2.8.0
Architecure: standard
Model Number: 2
Mode: train
Dataset: retina
Context nucleotides: 10000
Sequence length (output): 5000
Loading existing model
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, None, 4)]    0           []                               
                                                                                                  
 conv1d (Conv1D)                (None, None, 32)     160         ['input_1[0][0]']                
                                                                                                  
 batch_normalization (BatchNorm  (None, None, 32)    128         ['conv1d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 activation (Activation)        (None, None, 32)     0           ['batch_normalization[0][0]']    
                                                                                                  
 conv1d_2 (Conv1D)              (None, None, 32)     11296       ['activation[0][0]']             
                                                                                                  
 batch_normalization_1 (BatchNo  (None, None, 32)    128         ['conv1d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_1 (Activation)      (None, None, 32)     0           ['batch_normalization_1[0][0]']  
                                                                                                  
 conv1d_3 (Conv1D)              (None, None, 32)     11296       ['activation_1[0][0]']           
                                                                                                  
 add (Add)                      (None, None, 32)     0           ['conv1d_3[0][0]',               
                                                                  'conv1d[0][0]']                 
                                                                                                  
 batch_normalization_2 (BatchNo  (None, None, 32)    128         ['add[0][0]']                    
 rmalization)                                                                                     
                                                                                                  
 activation_2 (Activation)      (None, None, 32)     0           ['batch_normalization_2[0][0]']  
                                                                                                  
 conv1d_4 (Conv1D)              (None, None, 32)     11296       ['activation_2[0][0]']           
                                                                                                  
 batch_normalization_3 (BatchNo  (None, None, 32)    128         ['conv1d_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_3 (Activation)      (None, None, 32)     0           ['batch_normalization_3[0][0]']  
                                                                                                  
 conv1d_5 (Conv1D)              (None, None, 32)     11296       ['activation_3[0][0]']           
                                                                                                  
 add_1 (Add)                    (None, None, 32)     0           ['conv1d_5[0][0]',               
                                                                  'add[0][0]']                    
                                                                                                  
 batch_normalization_4 (BatchNo  (None, None, 32)    128         ['add_1[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_4 (Activation)      (None, None, 32)     0           ['batch_normalization_4[0][0]']  
                                                                                                  
 conv1d_6 (Conv1D)              (None, None, 32)     11296       ['activation_4[0][0]']           
                                                                                                  
 batch_normalization_5 (BatchNo  (None, None, 32)    128         ['conv1d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_5 (Activation)      (None, None, 32)     0           ['batch_normalization_5[0][0]']  
                                                                                                  
 conv1d_7 (Conv1D)              (None, None, 32)     11296       ['activation_5[0][0]']           
                                                                                                  
 add_2 (Add)                    (None, None, 32)     0           ['conv1d_7[0][0]',               
                                                                  'add_1[0][0]']                  
                                                                                                  
 batch_normalization_6 (BatchNo  (None, None, 32)    128         ['add_2[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_6 (Activation)      (None, None, 32)     0           ['batch_normalization_6[0][0]']  
                                                                                                  
 conv1d_8 (Conv1D)              (None, None, 32)     11296       ['activation_6[0][0]']           
                                                                                                  
 batch_normalization_7 (BatchNo  (None, None, 32)    128         ['conv1d_8[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_7 (Activation)      (None, None, 32)     0           ['batch_normalization_7[0][0]']  
                                                                                                  
 conv1d_9 (Conv1D)              (None, None, 32)     11296       ['activation_7[0][0]']           
                                                                                                  
 add_3 (Add)                    (None, None, 32)     0           ['conv1d_9[0][0]',               
                                                                  'add_2[0][0]']                  
                                                                                                  
 batch_normalization_8 (BatchNo  (None, None, 32)    128         ['add_3[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_8 (Activation)      (None, None, 32)     0           ['batch_normalization_8[0][0]']  
                                                                                                  
 conv1d_11 (Conv1D)             (None, None, 32)     11296       ['activation_8[0][0]']           
                                                                                                  
 batch_normalization_9 (BatchNo  (None, None, 32)    128         ['conv1d_11[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 activation_9 (Activation)      (None, None, 32)     0           ['batch_normalization_9[0][0]']  
                                                                                                  
 conv1d_12 (Conv1D)             (None, None, 32)     11296       ['activation_9[0][0]']           
                                                                                                  
 add_5 (Add)                    (None, None, 32)     0           ['conv1d_12[0][0]',              
                                                                  'add_3[0][0]']                  
                                                                                                  
 batch_normalization_10 (BatchN  (None, None, 32)    128         ['add_5[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_10 (Activation)     (None, None, 32)     0           ['batch_normalization_10[0][0]'] 
                                                                                                  
 conv1d_13 (Conv1D)             (None, None, 32)     11296       ['activation_10[0][0]']          
                                                                                                  
 batch_normalization_11 (BatchN  (None, None, 32)    128         ['conv1d_13[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_11 (Activation)     (None, None, 32)     0           ['batch_normalization_11[0][0]'] 
                                                                                                  
 conv1d_14 (Conv1D)             (None, None, 32)     11296       ['activation_11[0][0]']          
                                                                                                  
 add_6 (Add)                    (None, None, 32)     0           ['conv1d_14[0][0]',              
                                                                  'add_5[0][0]']                  
                                                                                                  
 batch_normalization_12 (BatchN  (None, None, 32)    128         ['add_6[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_12 (Activation)     (None, None, 32)     0           ['batch_normalization_12[0][0]'] 
                                                                                                  
 conv1d_15 (Conv1D)             (None, None, 32)     11296       ['activation_12[0][0]']          
                                                                                                  
 batch_normalization_13 (BatchN  (None, None, 32)    128         ['conv1d_15[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_13 (Activation)     (None, None, 32)     0           ['batch_normalization_13[0][0]'] 
                                                                                                  
 conv1d_16 (Conv1D)             (None, None, 32)     11296       ['activation_13[0][0]']          
                                                                                                  
 add_7 (Add)                    (None, None, 32)     0           ['conv1d_16[0][0]',              
                                                                  'add_6[0][0]']                  
                                                                                                  
 batch_normalization_14 (BatchN  (None, None, 32)    128         ['add_7[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_14 (Activation)     (None, None, 32)     0           ['batch_normalization_14[0][0]'] 
                                                                                                  
 conv1d_17 (Conv1D)             (None, None, 32)     11296       ['activation_14[0][0]']          
                                                                                                  
 batch_normalization_15 (BatchN  (None, None, 32)    128         ['conv1d_17[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_15 (Activation)     (None, None, 32)     0           ['batch_normalization_15[0][0]'] 
                                                                                                  
 conv1d_18 (Conv1D)             (None, None, 32)     11296       ['activation_15[0][0]']          
                                                                                                  
 add_8 (Add)                    (None, None, 32)     0           ['conv1d_18[0][0]',              
                                                                  'add_7[0][0]']                  
                                                                                                  
 batch_normalization_16 (BatchN  (None, None, 32)    128         ['add_8[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_16 (Activation)     (None, None, 32)     0           ['batch_normalization_16[0][0]'] 
                                                                                                  
 conv1d_20 (Conv1D)             (None, None, 32)     21536       ['activation_16[0][0]']          
                                                                                                  
 batch_normalization_17 (BatchN  (None, None, 32)    128         ['conv1d_20[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_17 (Activation)     (None, None, 32)     0           ['batch_normalization_17[0][0]'] 
                                                                                                  
 conv1d_21 (Conv1D)             (None, None, 32)     21536       ['activation_17[0][0]']          
                                                                                                  
 add_10 (Add)                   (None, None, 32)     0           ['conv1d_21[0][0]',              
                                                                  'add_8[0][0]']                  
                                                                                                  
 batch_normalization_18 (BatchN  (None, None, 32)    128         ['add_10[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_18 (Activation)     (None, None, 32)     0           ['batch_normalization_18[0][0]'] 
                                                                                                  
 conv1d_22 (Conv1D)             (None, None, 32)     21536       ['activation_18[0][0]']          
                                                                                                  
 batch_normalization_19 (BatchN  (None, None, 32)    128         ['conv1d_22[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_19 (Activation)     (None, None, 32)     0           ['batch_normalization_19[0][0]'] 
                                                                                                  
 conv1d_23 (Conv1D)             (None, None, 32)     21536       ['activation_19[0][0]']          
                                                                                                  
 add_11 (Add)                   (None, None, 32)     0           ['conv1d_23[0][0]',              
                                                                  'add_10[0][0]']                 
                                                                                                  
 batch_normalization_20 (BatchN  (None, None, 32)    128         ['add_11[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_20 (Activation)     (None, None, 32)     0           ['batch_normalization_20[0][0]'] 
                                                                                                  
 conv1d_24 (Conv1D)             (None, None, 32)     21536       ['activation_20[0][0]']          
                                                                                                  
 batch_normalization_21 (BatchN  (None, None, 32)    128         ['conv1d_24[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_21 (Activation)     (None, None, 32)     0           ['batch_normalization_21[0][0]'] 
                                                                                                  
 conv1d_25 (Conv1D)             (None, None, 32)     21536       ['activation_21[0][0]']          
                                                                                                  
 add_12 (Add)                   (None, None, 32)     0           ['conv1d_25[0][0]',              
                                                                  'add_11[0][0]']                 
                                                                                                  
 batch_normalization_22 (BatchN  (None, None, 32)    128         ['add_12[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_22 (Activation)     (None, None, 32)     0           ['batch_normalization_22[0][0]'] 
                                                                                                  
 conv1d_26 (Conv1D)             (None, None, 32)     21536       ['activation_22[0][0]']          
                                                                                                  
 batch_normalization_23 (BatchN  (None, None, 32)    128         ['conv1d_26[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_23 (Activation)     (None, None, 32)     0           ['batch_normalization_23[0][0]'] 
                                                                                                  
 conv1d_27 (Conv1D)             (None, None, 32)     21536       ['activation_23[0][0]']          
                                                                                                  
 add_13 (Add)                   (None, None, 32)     0           ['conv1d_27[0][0]',              
                                                                  'add_12[0][0]']                 
                                                                                                  
 batch_normalization_24 (BatchN  (None, None, 32)    128         ['add_13[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_24 (Activation)     (None, None, 32)     0           ['batch_normalization_24[0][0]'] 
                                                                                                  
 conv1d_29 (Conv1D)             (None, None, 32)     42016       ['activation_24[0][0]']          
                                                                                                  
 batch_normalization_25 (BatchN  (None, None, 32)    128         ['conv1d_29[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_25 (Activation)     (None, None, 32)     0           ['batch_normalization_25[0][0]'] 
                                                                                                  
 conv1d_30 (Conv1D)             (None, None, 32)     42016       ['activation_25[0][0]']          
                                                                                                  
 add_15 (Add)                   (None, None, 32)     0           ['conv1d_30[0][0]',              
                                                                  'add_13[0][0]']                 
                                                                                                  
 batch_normalization_26 (BatchN  (None, None, 32)    128         ['add_15[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_26 (Activation)     (None, None, 32)     0           ['batch_normalization_26[0][0]'] 
                                                                                                  
 conv1d_31 (Conv1D)             (None, None, 32)     42016       ['activation_26[0][0]']          
                                                                                                  
 batch_normalization_27 (BatchN  (None, None, 32)    128         ['conv1d_31[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_27 (Activation)     (None, None, 32)     0           ['batch_normalization_27[0][0]'] 
                                                                                                  
 conv1d_32 (Conv1D)             (None, None, 32)     42016       ['activation_27[0][0]']          
                                                                                                  
 add_16 (Add)                   (None, None, 32)     0           ['conv1d_32[0][0]',              
                                                                  'add_15[0][0]']                 
                                                                                                  
 batch_normalization_28 (BatchN  (None, None, 32)    128         ['add_16[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_28 (Activation)     (None, None, 32)     0           ['batch_normalization_28[0][0]'] 
                                                                                                  
 conv1d_33 (Conv1D)             (None, None, 32)     42016       ['activation_28[0][0]']          
                                                                                                  
 batch_normalization_29 (BatchN  (None, None, 32)    128         ['conv1d_33[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_29 (Activation)     (None, None, 32)     0           ['batch_normalization_29[0][0]'] 
                                                                                                  
 conv1d_34 (Conv1D)             (None, None, 32)     42016       ['activation_29[0][0]']          
                                                                                                  
 add_17 (Add)                   (None, None, 32)     0           ['conv1d_34[0][0]',              
                                                                  'add_16[0][0]']                 
                                                                                                  
 batch_normalization_30 (BatchN  (None, None, 32)    128         ['add_17[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_30 (Activation)     (None, None, 32)     0           ['batch_normalization_30[0][0]'] 
                                                                                                  
 conv1d_35 (Conv1D)             (None, None, 32)     42016       ['activation_30[0][0]']          
                                                                                                  
 batch_normalization_31 (BatchN  (None, None, 32)    128         ['conv1d_35[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 conv1d_1 (Conv1D)              (None, None, 32)     1056        ['conv1d[0][0]']                 
                                                                                                  
 conv1d_10 (Conv1D)             (None, None, 32)     1056        ['add_3[0][0]']                  
                                                                                                  
 activation_31 (Activation)     (None, None, 32)     0           ['batch_normalization_31[0][0]'] 
                                                                                                  
 add_4 (Add)                    (None, None, 32)     0           ['conv1d_1[0][0]',               
                                                                  'conv1d_10[0][0]']              
                                                                                                  
 conv1d_19 (Conv1D)             (None, None, 32)     1056        ['add_8[0][0]']                  
                                                                                                  
 conv1d_36 (Conv1D)             (None, None, 32)     42016       ['activation_31[0][0]']          
                                                                                                  
 add_9 (Add)                    (None, None, 32)     0           ['add_4[0][0]',                  
                                                                  'conv1d_19[0][0]']              
                                                                                                  
 conv1d_28 (Conv1D)             (None, None, 32)     1056        ['add_13[0][0]']                 
                                                                                                  
 add_18 (Add)                   (None, None, 32)     0           ['conv1d_36[0][0]',              
                                                                  'add_17[0][0]']                 
                                                                                                  
 add_14 (Add)                   (None, None, 32)     0           ['add_9[0][0]',                  
                                                                  'conv1d_28[0][0]']              
                                                                                                  
 conv1d_37 (Conv1D)             (None, None, 32)     1056        ['add_18[0][0]']                 
                                                                                                  
 add_19 (Add)                   (None, None, 32)     0           ['add_14[0][0]',                 
                                                                  'conv1d_37[0][0]']              
                                                                                                  
 cropping1d (Cropping1D)        (None, None, 32)     0           ['add_19[0][0]']                 
                                                                                                  
 batch_normalization_32 (BatchN  (None, None, 32)    128         ['cropping1d[0][0]']             
 ormalization)                                                                                    
                                                                                                  
 conv1d_38 (Conv1D)             (None, None, 3)      99          ['batch_normalization_32[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
Loading training data
standard training and loss
Model architecture not known
('start time: ', 1718450865.0827193)
1
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9243	1:0.7155	:0.8097	4:0.8661	PR-AUC:0.7399	0.5:0.9027	1:0.2096	2:0.0284	4:0.0071	SS:13312

Donor:
0.5:0.9198	1:0.7229	:0.8141	4:0.8680	PR-AUC:0.7407	0.5:0.9155	1:0.2477	2:0.0327	4:0.0076	SS:13338

Training set metrics:

Acceptor:
0.5:0.9068	1:0.7255	:0.8245	4:0.8826	PR-AUC:0.7406	0.5:0.9111	1:0.2226	2:0.0289	4:0.0069	SS:13159

Donor:
0.5:0.8988	1:0.7271	:0.8279	4:0.8812	PR-AUC:0.7368	0.5:0.9283	1:0.2737	2:0.0321	4:0.0073	SS:13205
Learning rate: 0.00100
--- 9722.071759700775 seconds ---
--------------------------------------------------------------
2
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9358	1:0.7422	:0.8514	4:0.9079	PR-AUC:0.7843	0.5:0.7697	1:0.1615	2:0.0274	4:0.0080	SS:13312

Donor:
0.5:0.9387	1:0.7471	:0.8569	4:0.9105	PR-AUC:0.7917	0.5:0.7222	1:0.1428	2:0.0249	4:0.0073	SS:13338

Training set metrics:

Acceptor:
0.5:0.9333	1:0.7639	:0.8742	4:0.9249	PR-AUC:0.8017	0.5:0.7923	1:0.1714	2:0.0273	4:0.0078	SS:13159

Donor:
0.5:0.9311	1:0.7585	:0.8771	4:0.9301	PR-AUC:0.8024	0.5:0.7455	1:0.1550	2:0.0245	4:0.0069	SS:13205
Learning rate: 0.00100
--- 10071.959904193878 seconds ---
--------------------------------------------------------------
3
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9129	1:0.7247	:0.8159	4:0.8700	PR-AUC:0.7379	0.5:0.8617	1:0.4044	2:0.0691	4:0.0149	SS:13312

Donor:
0.5:0.9255	1:0.7292	:0.8255	4:0.8831	PR-AUC:0.7548	0.5:0.8272	1:0.3392	2:0.0607	4:0.0142	SS:13338

Training set metrics:

Acceptor:
0.5:0.9099	1:0.7425	:0.8408	4:0.8939	PR-AUC:0.7597	0.5:0.8682	1:0.4280	2:0.0668	4:0.0137	SS:13159

Donor:
0.5:0.9144	1:0.7393	:0.8514	4:0.9097	PR-AUC:0.7702	0.5:0.8369	1:0.3568	2:0.0600	4:0.0133	SS:13205
Learning rate: 0.00100
--- 10773.382865905762 seconds ---
--------------------------------------------------------------
4
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9474	1:0.7716	:0.8735	4:0.9203	PR-AUC:0.8117	0.5:0.8736	1:0.2590	2:0.0406	4:0.0113	SS:13312

Donor:
0.5:0.9472	1:0.7734	:0.8793	4:0.9256	PR-AUC:0.8180	0.5:0.8442	1:0.2353	2:0.0399	4:0.0116	SS:13338

Training set metrics:

Acceptor:
0.5:0.9375	1:0.8007	:0.9036	4:0.9456	PR-AUC:0.8344	0.5:0.8934	1:0.2938	2:0.0411	4:0.0110	SS:13159

Donor:
0.5:0.9329	1:0.7923	:0.9035	4:0.9456	PR-AUC:0.8310	0.5:0.8678	1:0.2651	2:0.0414	4:0.0114	SS:13205
Learning rate: 0.00100
--- 9988.792847394943 seconds ---
--------------------------------------------------------------
5
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9419	1:0.7802	:0.8812	4:0.9252	PR-AUC:0.8174	0.5:0.9346	1:0.2546	2:0.0242	4:0.0055	SS:13312

Donor:
0.5:0.9460	1:0.7845	:0.8860	4:0.9294	PR-AUC:0.8243	0.5:0.9542	1:0.2582	2:0.0233	4:0.0050	SS:13338

Training set metrics:

Acceptor:
0.5:0.9479	1:0.8221	:0.9233	4:0.9561	PR-AUC:0.8615	0.5:0.9460	1:0.2955	2:0.0232	4:0.0050	SS:13159

Donor:
0.5:0.9446	1:0.8164	:0.9240	4:0.9583	PR-AUC:0.8582	0.5:0.9614	1:0.2999	2:0.0226	4:0.0046	SS:13205
Learning rate: 0.00100
--- 10133.59744143486 seconds ---
--------------------------------------------------------------
6
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9486	1:0.7776	:0.8809	4:0.9301	PR-AUC:0.8233	0.5:0.9670	1:0.4288	2:0.0582	4:0.0135	SS:13312

Donor:
0.5:0.9498	1:0.7833	:0.8859	4:0.9325	PR-AUC:0.8284	0.5:0.9738	1:0.4576	2:0.0570	4:0.0121	SS:13338

Training set metrics:

Acceptor:
0.5:0.9454	1:0.8150	:0.9203	4:0.9575	PR-AUC:0.8562	0.5:0.9731	1:0.4997	2:0.0594	4:0.0133	SS:13159

Donor:
0.5:0.9494	1:0.8111	:0.9239	4:0.9611	PR-AUC:0.8584	0.5:0.9779	1:0.5201	2:0.0584	4:0.0118	SS:13205
Learning rate: 0.00100
--- 9679.129176616669 seconds ---
--------------------------------------------------------------
7
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9462	1:0.7728	:0.8803	4:0.9256	PR-AUC:0.8197	0.5:0.9514	1:0.3937	2:0.0481	4:0.0099	SS:13312

Donor:
0.5:0.9505	1:0.7790	:0.8803	4:0.9284	PR-AUC:0.8219	0.5:0.9278	1:0.3855	2:0.0497	4:0.0098	SS:13338

Training set metrics:

Acceptor:
0.5:0.9635	1:0.8344	:0.9401	4:0.9694	PR-AUC:0.8855	0.5:0.9587	1:0.4583	2:0.0459	4:0.0091	SS:13159

Donor:
0.5:0.9605	1:0.8295	:0.9376	4:0.9713	PR-AUC:0.8835	0.5:0.9394	1:0.4271	2:0.0477	4:0.0090	SS:13205
Learning rate: 0.00050
--- 10334.825223207474 seconds ---
--------------------------------------------------------------
8
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9452	1:0.7870	:0.8852	4:0.9295	PR-AUC:0.8248	0.5:0.9555	1:0.3862	2:0.0324	4:0.0060	SS:13312

Donor:
0.5:0.9498	1:0.7920	:0.8894	4:0.9316	PR-AUC:0.8308	0.5:0.9593	1:0.3754	2:0.0337	4:0.0062	SS:13338

Training set metrics:

Acceptor:
0.5:0.9710	1:0.8575	:0.9531	4:0.9778	PR-AUC:0.9082	0.5:0.9630	1:0.4632	2:0.0324	4:0.0058	SS:13159

Donor:
0.5:0.9655	1:0.8491	:0.9534	4:0.9777	PR-AUC:0.9040	0.5:0.9671	1:0.4688	2:0.0341	4:0.0058	SS:13205
Learning rate: 0.00025
--- 9888.994273662567 seconds ---
--------------------------------------------------------------
9
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9464	1:0.7900	:0.8893	4:0.9329	PR-AUC:0.8296	0.5:0.9597	1:0.3461	2:0.0263	4:0.0049	SS:13312

Donor:
0.5:0.9466	1:0.7940	:0.8924	4:0.9312	PR-AUC:0.8303	0.5:0.9537	1:0.3633	2:0.0310	4:0.0058	SS:13338

Training set metrics:

Acceptor:
0.5:0.9769	1:0.8695	:0.9613	4:0.9808	PR-AUC:0.9201	0.5:0.9679	1:0.4409	2:0.0261	4:0.0047	SS:13159

Donor:
0.5:0.9721	1:0.8633	:0.9629	4:0.9831	PR-AUC:0.9175	0.5:0.9632	1:0.4557	2:0.0315	4:0.0056	SS:13205
Learning rate: 0.00013
--- 10473.615381240845 seconds ---
--------------------------------------------------------------
10
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.9458	1:0.7870	:0.8901	4:0.9319	PR-AUC:0.8287	0.5:0.9674	1:0.3595	2:0.0276	4:0.0049	SS:13312

Donor:
0.5:0.9472	1:0.7950	:0.8911	4:0.9333	PR-AUC:0.8311	0.5:0.9597	1:0.3497	2:0.0284	4:0.0052	SS:13338

Training set metrics:

Acceptor:
0.5:0.9763	1:0.8707	:0.9617	4:0.9829	PR-AUC:0.9210	0.5:0.9735	1:0.4479	2:0.0272	4:0.0046	SS:13159

Donor:
0.5:0.9715	1:0.8638	:0.9622	4:0.9831	PR-AUC:0.9185	0.5:0.9683	1:0.4339	2:0.0285	4:0.0048	SS:13205
Learning rate: 0.00006
--- 10650.175411939621 seconds ---
--------------------------------------------------------------
