2.8.0
Architecure: optimized
Model Number: 1
Mode: train
Dataset: retina
Context nucleotides: 10000
Sequence length (output): 5000
Loading existing model
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, None, 4)]    0           []                               
                                                                                                  
 conv1d (Conv1D)                (None, None, 32)     160         ['input_1[0][0]']                
                                                                                                  
 batch_normalization (BatchNorm  (None, None, 32)    128         ['conv1d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 activation (Activation)        (None, None, 32)     0           ['batch_normalization[0][0]']    
                                                                                                  
 conv1d_2 (Conv1D)              (None, None, 32)     11296       ['activation[0][0]']             
                                                                                                  
 batch_normalization_1 (BatchNo  (None, None, 32)    128         ['conv1d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_1 (Activation)      (None, None, 32)     0           ['batch_normalization_1[0][0]']  
                                                                                                  
 conv1d_3 (Conv1D)              (None, None, 32)     11296       ['activation_1[0][0]']           
                                                                                                  
 add (Add)                      (None, None, 32)     0           ['conv1d_3[0][0]',               
                                                                  'conv1d[0][0]']                 
                                                                                                  
 batch_normalization_2 (BatchNo  (None, None, 32)    128         ['add[0][0]']                    
 rmalization)                                                                                     
                                                                                                  
 activation_2 (Activation)      (None, None, 32)     0           ['batch_normalization_2[0][0]']  
                                                                                                  
 conv1d_4 (Conv1D)              (None, None, 32)     11296       ['activation_2[0][0]']           
                                                                                                  
 batch_normalization_3 (BatchNo  (None, None, 32)    128         ['conv1d_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_3 (Activation)      (None, None, 32)     0           ['batch_normalization_3[0][0]']  
                                                                                                  
 conv1d_5 (Conv1D)              (None, None, 32)     11296       ['activation_3[0][0]']           
                                                                                                  
 add_1 (Add)                    (None, None, 32)     0           ['conv1d_5[0][0]',               
                                                                  'add[0][0]']                    
                                                                                                  
 batch_normalization_4 (BatchNo  (None, None, 32)    128         ['add_1[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_4 (Activation)      (None, None, 32)     0           ['batch_normalization_4[0][0]']  
                                                                                                  
 conv1d_6 (Conv1D)              (None, None, 32)     11296       ['activation_4[0][0]']           
                                                                                                  
 batch_normalization_5 (BatchNo  (None, None, 32)    128         ['conv1d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_5 (Activation)      (None, None, 32)     0           ['batch_normalization_5[0][0]']  
                                                                                                  
 conv1d_7 (Conv1D)              (None, None, 32)     11296       ['activation_5[0][0]']           
                                                                                                  
 add_2 (Add)                    (None, None, 32)     0           ['conv1d_7[0][0]',               
                                                                  'add_1[0][0]']                  
                                                                                                  
 batch_normalization_6 (BatchNo  (None, None, 32)    128         ['add_2[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_6 (Activation)      (None, None, 32)     0           ['batch_normalization_6[0][0]']  
                                                                                                  
 conv1d_8 (Conv1D)              (None, None, 32)     11296       ['activation_6[0][0]']           
                                                                                                  
 batch_normalization_7 (BatchNo  (None, None, 32)    128         ['conv1d_8[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_7 (Activation)      (None, None, 32)     0           ['batch_normalization_7[0][0]']  
                                                                                                  
 conv1d_9 (Conv1D)              (None, None, 32)     11296       ['activation_7[0][0]']           
                                                                                                  
 add_3 (Add)                    (None, None, 32)     0           ['conv1d_9[0][0]',               
                                                                  'add_2[0][0]']                  
                                                                                                  
 batch_normalization_8 (BatchNo  (None, None, 32)    128         ['add_3[0][0]']                  
 rmalization)                                                                                     
                                                                                                  
 activation_8 (Activation)      (None, None, 32)     0           ['batch_normalization_8[0][0]']  
                                                                                                  
 conv1d_11 (Conv1D)             (None, None, 32)     11296       ['activation_8[0][0]']           
                                                                                                  
 batch_normalization_9 (BatchNo  (None, None, 32)    128         ['conv1d_11[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 activation_9 (Activation)      (None, None, 32)     0           ['batch_normalization_9[0][0]']  
                                                                                                  
 conv1d_12 (Conv1D)             (None, None, 32)     11296       ['activation_9[0][0]']           
                                                                                                  
 add_5 (Add)                    (None, None, 32)     0           ['conv1d_12[0][0]',              
                                                                  'add_3[0][0]']                  
                                                                                                  
 batch_normalization_10 (BatchN  (None, None, 32)    128         ['add_5[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_10 (Activation)     (None, None, 32)     0           ['batch_normalization_10[0][0]'] 
                                                                                                  
 conv1d_13 (Conv1D)             (None, None, 32)     11296       ['activation_10[0][0]']          
                                                                                                  
 batch_normalization_11 (BatchN  (None, None, 32)    128         ['conv1d_13[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_11 (Activation)     (None, None, 32)     0           ['batch_normalization_11[0][0]'] 
                                                                                                  
 conv1d_14 (Conv1D)             (None, None, 32)     11296       ['activation_11[0][0]']          
                                                                                                  
 add_6 (Add)                    (None, None, 32)     0           ['conv1d_14[0][0]',              
                                                                  'add_5[0][0]']                  
                                                                                                  
 batch_normalization_12 (BatchN  (None, None, 32)    128         ['add_6[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_12 (Activation)     (None, None, 32)     0           ['batch_normalization_12[0][0]'] 
                                                                                                  
 conv1d_15 (Conv1D)             (None, None, 32)     11296       ['activation_12[0][0]']          
                                                                                                  
 batch_normalization_13 (BatchN  (None, None, 32)    128         ['conv1d_15[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_13 (Activation)     (None, None, 32)     0           ['batch_normalization_13[0][0]'] 
                                                                                                  
 conv1d_16 (Conv1D)             (None, None, 32)     11296       ['activation_13[0][0]']          
                                                                                                  
 add_7 (Add)                    (None, None, 32)     0           ['conv1d_16[0][0]',              
                                                                  'add_6[0][0]']                  
                                                                                                  
 batch_normalization_14 (BatchN  (None, None, 32)    128         ['add_7[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_14 (Activation)     (None, None, 32)     0           ['batch_normalization_14[0][0]'] 
                                                                                                  
 conv1d_17 (Conv1D)             (None, None, 32)     11296       ['activation_14[0][0]']          
                                                                                                  
 batch_normalization_15 (BatchN  (None, None, 32)    128         ['conv1d_17[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_15 (Activation)     (None, None, 32)     0           ['batch_normalization_15[0][0]'] 
                                                                                                  
 conv1d_18 (Conv1D)             (None, None, 32)     11296       ['activation_15[0][0]']          
                                                                                                  
 add_8 (Add)                    (None, None, 32)     0           ['conv1d_18[0][0]',              
                                                                  'add_7[0][0]']                  
                                                                                                  
 batch_normalization_16 (BatchN  (None, None, 32)    128         ['add_8[0][0]']                  
 ormalization)                                                                                    
                                                                                                  
 activation_16 (Activation)     (None, None, 32)     0           ['batch_normalization_16[0][0]'] 
                                                                                                  
 conv1d_20 (Conv1D)             (None, None, 32)     21536       ['activation_16[0][0]']          
                                                                                                  
 batch_normalization_17 (BatchN  (None, None, 32)    128         ['conv1d_20[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_17 (Activation)     (None, None, 32)     0           ['batch_normalization_17[0][0]'] 
                                                                                                  
 conv1d_21 (Conv1D)             (None, None, 32)     21536       ['activation_17[0][0]']          
                                                                                                  
 add_10 (Add)                   (None, None, 32)     0           ['conv1d_21[0][0]',              
                                                                  'add_8[0][0]']                  
                                                                                                  
 batch_normalization_18 (BatchN  (None, None, 32)    128         ['add_10[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_18 (Activation)     (None, None, 32)     0           ['batch_normalization_18[0][0]'] 
                                                                                                  
 conv1d_22 (Conv1D)             (None, None, 32)     21536       ['activation_18[0][0]']          
                                                                                                  
 batch_normalization_19 (BatchN  (None, None, 32)    128         ['conv1d_22[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_19 (Activation)     (None, None, 32)     0           ['batch_normalization_19[0][0]'] 
                                                                                                  
 conv1d_23 (Conv1D)             (None, None, 32)     21536       ['activation_19[0][0]']          
                                                                                                  
 add_11 (Add)                   (None, None, 32)     0           ['conv1d_23[0][0]',              
                                                                  'add_10[0][0]']                 
                                                                                                  
 batch_normalization_20 (BatchN  (None, None, 32)    128         ['add_11[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_20 (Activation)     (None, None, 32)     0           ['batch_normalization_20[0][0]'] 
                                                                                                  
 conv1d_24 (Conv1D)             (None, None, 32)     21536       ['activation_20[0][0]']          
                                                                                                  
 batch_normalization_21 (BatchN  (None, None, 32)    128         ['conv1d_24[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_21 (Activation)     (None, None, 32)     0           ['batch_normalization_21[0][0]'] 
                                                                                                  
 conv1d_25 (Conv1D)             (None, None, 32)     21536       ['activation_21[0][0]']          
                                                                                                  
 add_12 (Add)                   (None, None, 32)     0           ['conv1d_25[0][0]',              
                                                                  'add_11[0][0]']                 
                                                                                                  
 batch_normalization_22 (BatchN  (None, None, 32)    128         ['add_12[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_22 (Activation)     (None, None, 32)     0           ['batch_normalization_22[0][0]'] 
                                                                                                  
 conv1d_26 (Conv1D)             (None, None, 32)     21536       ['activation_22[0][0]']          
                                                                                                  
 batch_normalization_23 (BatchN  (None, None, 32)    128         ['conv1d_26[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_23 (Activation)     (None, None, 32)     0           ['batch_normalization_23[0][0]'] 
                                                                                                  
 conv1d_27 (Conv1D)             (None, None, 32)     21536       ['activation_23[0][0]']          
                                                                                                  
 add_13 (Add)                   (None, None, 32)     0           ['conv1d_27[0][0]',              
                                                                  'add_12[0][0]']                 
                                                                                                  
 batch_normalization_24 (BatchN  (None, None, 32)    128         ['add_13[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_24 (Activation)     (None, None, 32)     0           ['batch_normalization_24[0][0]'] 
                                                                                                  
 conv1d_29 (Conv1D)             (None, None, 32)     42016       ['activation_24[0][0]']          
                                                                                                  
 batch_normalization_25 (BatchN  (None, None, 32)    128         ['conv1d_29[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_25 (Activation)     (None, None, 32)     0           ['batch_normalization_25[0][0]'] 
                                                                                                  
 conv1d_30 (Conv1D)             (None, None, 32)     42016       ['activation_25[0][0]']          
                                                                                                  
 add_15 (Add)                   (None, None, 32)     0           ['conv1d_30[0][0]',              
                                                                  'add_13[0][0]']                 
                                                                                                  
 batch_normalization_26 (BatchN  (None, None, 32)    128         ['add_15[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_26 (Activation)     (None, None, 32)     0           ['batch_normalization_26[0][0]'] 
                                                                                                  
 conv1d_31 (Conv1D)             (None, None, 32)     42016       ['activation_26[0][0]']          
                                                                                                  
 batch_normalization_27 (BatchN  (None, None, 32)    128         ['conv1d_31[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_27 (Activation)     (None, None, 32)     0           ['batch_normalization_27[0][0]'] 
                                                                                                  
 conv1d_32 (Conv1D)             (None, None, 32)     42016       ['activation_27[0][0]']          
                                                                                                  
 add_16 (Add)                   (None, None, 32)     0           ['conv1d_32[0][0]',              
                                                                  'add_15[0][0]']                 
                                                                                                  
 batch_normalization_28 (BatchN  (None, None, 32)    128         ['add_16[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_28 (Activation)     (None, None, 32)     0           ['batch_normalization_28[0][0]'] 
                                                                                                  
 conv1d_33 (Conv1D)             (None, None, 32)     42016       ['activation_28[0][0]']          
                                                                                                  
 batch_normalization_29 (BatchN  (None, None, 32)    128         ['conv1d_33[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_29 (Activation)     (None, None, 32)     0           ['batch_normalization_29[0][0]'] 
                                                                                                  
 conv1d_34 (Conv1D)             (None, None, 32)     42016       ['activation_29[0][0]']          
                                                                                                  
 add_17 (Add)                   (None, None, 32)     0           ['conv1d_34[0][0]',              
                                                                  'add_16[0][0]']                 
                                                                                                  
 batch_normalization_30 (BatchN  (None, None, 32)    128         ['add_17[0][0]']                 
 ormalization)                                                                                    
                                                                                                  
 activation_30 (Activation)     (None, None, 32)     0           ['batch_normalization_30[0][0]'] 
                                                                                                  
 conv1d_35 (Conv1D)             (None, None, 32)     42016       ['activation_30[0][0]']          
                                                                                                  
 batch_normalization_31 (BatchN  (None, None, 32)    128         ['conv1d_35[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 conv1d_1 (Conv1D)              (None, None, 32)     1056        ['conv1d[0][0]']                 
                                                                                                  
 conv1d_10 (Conv1D)             (None, None, 32)     1056        ['add_3[0][0]']                  
                                                                                                  
 activation_31 (Activation)     (None, None, 32)     0           ['batch_normalization_31[0][0]'] 
                                                                                                  
 add_4 (Add)                    (None, None, 32)     0           ['conv1d_1[0][0]',               
                                                                  'conv1d_10[0][0]']              
                                                                                                  
 conv1d_19 (Conv1D)             (None, None, 32)     1056        ['add_8[0][0]']                  
                                                                                                  
 conv1d_36 (Conv1D)             (None, None, 32)     42016       ['activation_31[0][0]']          
                                                                                                  
 add_9 (Add)                    (None, None, 32)     0           ['add_4[0][0]',                  
                                                                  'conv1d_19[0][0]']              
                                                                                                  
 conv1d_28 (Conv1D)             (None, None, 32)     1056        ['add_13[0][0]']                 
                                                                                                  
 add_18 (Add)                   (None, None, 32)     0           ['conv1d_36[0][0]',              
                                                                  'add_17[0][0]']                 
                                                                                                  
 add_14 (Add)                   (None, None, 32)     0           ['add_9[0][0]',                  
                                                                  'conv1d_28[0][0]']              
                                                                                                  
 conv1d_37 (Conv1D)             (None, None, 32)     1056        ['add_18[0][0]']                 
                                                                                                  
 add_19 (Add)                   (None, None, 32)     0           ['add_14[0][0]',                 
                                                                  'conv1d_37[0][0]']              
                                                                                                  
 cropping1d (Cropping1D)        (None, None, 32)     0           ['add_19[0][0]']                 
                                                                                                  
 batch_normalization_32 (BatchN  (None, None, 32)    128         ['cropping1d[0][0]']             
 ormalization)                                                                                    
                                                                                                  
 conv1d_38 (Conv1D)             (None, None, 3)      99          ['batch_normalization_32[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
Loading training data
optimized training and loss
Model architecture not known
('start time: ', 1718983871.4546273)
1
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8833	1:0.7062	:0.8186	4:0.8773	PR-AUC:0.7113	0.5:0.7350	1:0.1840	2:0.0381	4:0.0116	SS:14158

Donor:
0.5:0.8827	1:0.7086	:0.8179	4:0.8757	PR-AUC:0.7081	0.5:0.6103	1:0.1275	2:0.0280	4:0.0093	SS:14164

Training set metrics:

Acceptor:
0.5:0.9342	1:0.7421	:0.8478	4:0.9009	PR-AUC:0.7766	0.5:0.7672	1:0.1605	2:0.0291	4:0.0085	SS:13683

Donor:
0.5:0.9355	1:0.7503	:0.8500	4:0.9034	PR-AUC:0.7807	0.5:0.6372	1:0.1075	2:0.0214	4:0.0068	SS:13550
Learning rate: 0.00100
--- 9195.861827850342 seconds ---
--------------------------------------------------------------
2
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8825	1:0.7315	:0.8483	4:0.9037	PR-AUC:0.7284	0.5:0.8591	1:0.1933	2:0.0280	4:0.0070	SS:14158

Donor:
0.5:0.8842	1:0.7350	:0.8411	4:0.8948	PR-AUC:0.7272	0.5:0.8935	1:0.3002	2:0.0512	4:0.0125	SS:14164

Training set metrics:

Acceptor:
0.5:0.9415	1:0.7585	:0.8657	4:0.9179	PR-AUC:0.7983	0.5:0.8389	1:0.1583	2:0.0223	4:0.0059	SS:13683

Donor:
0.5:0.9446	1:0.7630	:0.8617	4:0.9085	PR-AUC:0.7986	0.5:0.8846	1:0.2535	2:0.0419	4:0.0100	SS:13550
Learning rate: 0.00100
--- 9940.054989099503 seconds ---
--------------------------------------------------------------
3
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8825	1:0.7374	:0.8505	4:0.9048	PR-AUC:0.7284	0.5:0.8472	1:0.0830	2:0.0093	4:0.0025	SS:14158

Donor:
0.5:0.8852	1:0.7390	:0.8550	4:0.9097	PR-AUC:0.7247	0.5:0.8118	1:0.0979	2:0.0106	4:0.0028	SS:14164

Training set metrics:

Acceptor:
0.5:0.9423	1:0.7737	:0.8861	4:0.9331	PR-AUC:0.8184	0.5:0.7835	1:0.0643	2:0.0086	4:0.0024	SS:13683

Donor:
0.5:0.9476	1:0.7834	:0.8927	4:0.9372	PR-AUC:0.8287	0.5:0.7498	1:0.0751	2:0.0098	4:0.0027	SS:13550
Learning rate: 0.00100
--- 10674.6168820858 seconds ---
--------------------------------------------------------------
4
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8878	1:0.7488	:0.8616	4:0.9167	PR-AUC:0.7524	0.5:0.9470	1:0.2268	2:0.0187	4:0.0040	SS:14158

Donor:
0.5:0.8872	1:0.7556	:0.8680	4:0.9198	PR-AUC:0.7521	0.5:0.9209	1:0.1777	2:0.0130	4:0.0029	SS:14164

Training set metrics:

Acceptor:
0.5:0.9494	1:0.7900	:0.8986	4:0.9429	PR-AUC:0.8384	0.5:0.9271	1:0.1740	2:0.0149	4:0.0033	SS:13683

Donor:
0.5:0.9504	1:0.8019	:0.9088	4:0.9477	PR-AUC:0.8469	0.5:0.9025	1:0.1409	2:0.0109	4:0.0025	SS:13550
Learning rate: 0.00100
--- 9446.186086416245 seconds ---
--------------------------------------------------------------
5
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8928	1:0.7618	:0.8681	4:0.9185	PR-AUC:0.7641	0.5:0.9363	1:0.2755	2:0.0278	4:0.0063	SS:14158

Donor:
0.5:0.8921	1:0.7604	:0.8682	4:0.9213	PR-AUC:0.7571	0.5:0.9595	1:0.3675	2:0.0438	4:0.0096	SS:14164

Training set metrics:

Acceptor:
0.5:0.9507	1:0.8026	:0.8975	4:0.9390	PR-AUC:0.8401	0.5:0.9447	1:0.2647	2:0.0271	4:0.0063	SS:13683

Donor:
0.5:0.9519	1:0.8045	:0.9045	4:0.9469	PR-AUC:0.8470	0.5:0.9660	1:0.3571	2:0.0422	4:0.0094	SS:13550
Learning rate: 0.00100
--- 10784.192158937454 seconds ---
--------------------------------------------------------------
6
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8939	1:0.7553	:0.8739	4:0.9227	PR-AUC:0.7652	0.5:0.8879	1:0.1560	2:0.0158	4:0.0035	SS:14158

Donor:
0.5:0.8860	1:0.7564	:0.8721	4:0.9225	PR-AUC:0.7566	0.5:0.9090	1:0.2210	2:0.0236	4:0.0052	SS:14164

Training set metrics:

Acceptor:
0.5:0.9613	1:0.8082	:0.9113	4:0.9479	PR-AUC:0.8587	0.5:0.8778	1:0.1357	2:0.0141	4:0.0033	SS:13683

Donor:
0.5:0.9590	1:0.8117	:0.9188	4:0.9539	PR-AUC:0.8626	0.5:0.9068	1:0.2186	2:0.0227	4:0.0052	SS:13550
Learning rate: 0.00100
--- 10575.220006465912 seconds ---
--------------------------------------------------------------
7
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8763	1:0.7598	:0.8678	4:0.9160	PR-AUC:0.7437	0.5:0.9133	1:0.2722	2:0.0309	4:0.0076	SS:14158

Donor:
0.5:0.8910	1:0.7604	:0.8682	4:0.9203	PR-AUC:0.7555	0.5:0.9368	1:0.2975	2:0.0349	4:0.0081	SS:14164

Training set metrics:

Acceptor:
0.5:0.9697	1:0.8231	:0.9217	4:0.9529	PR-AUC:0.8737	0.5:0.9091	1:0.2492	2:0.0298	4:0.0077	SS:13683

Donor:
0.5:0.9694	1:0.8262	:0.9286	4:0.9616	PR-AUC:0.8807	0.5:0.9380	1:0.3057	2:0.0358	4:0.0084	SS:13550
Learning rate: 0.00050
--- 10582.60349535942 seconds ---
--------------------------------------------------------------
8
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8909	1:0.7726	:0.8801	4:0.9257	PR-AUC:0.7752	0.5:0.9533	1:0.3418	2:0.0343	4:0.0074	SS:14158

Donor:
0.5:0.8920	1:0.7704	:0.8808	4:0.9283	PR-AUC:0.7684	0.5:0.9472	1:0.3374	2:0.0307	4:0.0063	SS:14164

Training set metrics:

Acceptor:
0.5:0.9769	1:0.8490	:0.9398	4:0.9672	PR-AUC:0.8989	0.5:0.9550	1:0.2945	2:0.0277	4:0.0065	SS:13683

Donor:
0.5:0.9777	1:0.8512	:0.9438	4:0.9716	PR-AUC:0.9038	0.5:0.9480	1:0.2896	2:0.0248	4:0.0053	SS:13550
Learning rate: 0.00025
--- 11018.020961761475 seconds ---
--------------------------------------------------------------
9
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8859	1:0.7769	:0.8831	4:0.9268	PR-AUC:0.7681	0.5:0.9656	1:0.2656	2:0.0187	4:0.0040	SS:14158

Donor:
0.5:0.8894	1:0.7772	:0.8828	4:0.9281	PR-AUC:0.7672	0.5:0.9567	1:0.2379	2:0.0167	4:0.0035	SS:14164

Training set metrics:

Acceptor:
0.5:0.9873	1:0.8763	:0.9577	4:0.9803	PR-AUC:0.9283	0.5:0.9652	1:0.2395	2:0.0171	4:0.0039	SS:13683

Donor:
0.5:0.9866	1:0.8763	:0.9608	4:0.9807	PR-AUC:0.9304	0.5:0.9598	1:0.2349	2:0.0159	4:0.0035	SS:13550
Learning rate: 0.00013
--- 9713.022342205048 seconds ---
--------------------------------------------------------------
10
--------------------------------------------------------------

Validation set metrics:

Acceptor:
0.5:0.8883	1:0.7729	:0.8798	4:0.9230	PR-AUC:0.7675	0.5:0.9787	1:0.2627	2:0.0134	4:0.0026	SS:14158

Donor:
0.5:0.8911	1:0.7754	:0.8784	4:0.9245	PR-AUC:0.7648	0.5:0.9722	1:0.2332	2:0.0122	4:0.0024	SS:14164

Training set metrics:

Acceptor:
0.5:0.9889	1:0.8856	:0.9652	4:0.9826	PR-AUC:0.9372	0.5:0.9800	1:0.2330	2:0.0115	4:0.0024	SS:13683

Donor:
0.5:0.9875	1:0.8877	:0.9669	4:0.9827	PR-AUC:0.9386	0.5:0.9758	1:0.2309	2:0.0109	4:0.0023	SS:13550
Learning rate: 0.00006
--- 10385.370771408081 seconds ---
--------------------------------------------------------------
